## ðŸ“… Day 5: Combining & Advanced Filtering

In [1]:
import numpy as np
import pandas as pd

concat()

In [2]:
df1 = pd.DataFrame({"ID":[1,2,3], "Name":["A","B","C"]})
df2 = pd.DataFrame({"ID":[4,5], "Name":["D","E"]})

Stack by row

In [4]:
pd.concat([df1, df2])

   ID Name
0   1    A
1   2    B
2   3    C
0   4    D
1   5    E

In [7]:
df3 = pd.DataFrame({
    "Age": [25, 30, 28],
    "Dept": ["IT", "HR", "Sales"]
})

Stack by cols

In [8]:
pd.concat([df1,df3], axis=1)

   ID Name  Age   Dept
0   1    A   25     IT
1   2    B   30     HR
2   3    C   28  Sales

merge()

In [11]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3, 4, 5],
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "DeptID": [101, 102, 101, 103, 104]
})
employees

   EmpID     Name  DeptID
0      1    Alice     101
1      2      Bob     102
2      3  Charlie     101
3      4    David     103
4      5      Eva     104

In [12]:
department = pd.DataFrame({
    "EmpID": [1,2,3,4,5],
    "Dept": ["IT", "Finance", "IT", "HR", "IT"]
})

department

   EmpID     Dept
0      1       IT
1      2  Finance
2      3       IT
3      4       HR
4      5       IT

innerjoin

In [15]:
pd.merge(employees, department, on="EmpID")

   EmpID     Name  DeptID     Dept
0      1    Alice     101       IT
1      2      Bob     102  Finance
2      3  Charlie     101       IT
3      4    David     103       HR
4      5      Eva     104       IT

In [21]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3, 5],
    "Name": ["Alice", "Bob", "David", "Eva"],
    "DeptID": [101, 102, 101, 104]
})
employees

   EmpID   Name  DeptID
0      1  Alice     101
1      2    Bob     102
2      3  David     101
3      5    Eva     104

In [22]:
department = pd.DataFrame({
    "EmpID": [1,3,4,5],
    "Dept": ["IT", "Finance", "HR", "IT"]
})

department

   EmpID     Dept
0      1       IT
1      3  Finance
2      4       HR
3      5       IT

outerjoin

In [27]:
pd.merge(employees, department, on="EmpID", how="outer", indicator=True)

   EmpID   Name  DeptID     Dept      _merge
0      1  Alice   101.0       IT        both
1      2    Bob   102.0      NaN   left_only
2      3  David   101.0  Finance        both
3      4    NaN     NaN       HR  right_only
4      5    Eva   104.0       IT        both

left join

In [25]:
pd.merge(employees,department, on="EmpID", how="left")

   EmpID   Name  DeptID     Dept
0      1  Alice     101       IT
1      2    Bob     102      NaN
2      3  David     101  Finance
3      5    Eva     104       IT

right join

In [26]:
pd.merge(employees, department, on="EmpID", how="right")

   EmpID   Name  DeptID     Dept
0      1  Alice   101.0       IT
1      3  David   101.0  Finance
2      4    NaN     NaN       HR
3      5    Eva   104.0       IT

In [28]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3, 5],
    "Name": ["Alice", "Bob", "David", "Eva"],
    "DeptID": [101, 102, 101, 104]
})
employees

   EmpID   Name  DeptID
0      1  Alice     101
1      2    Bob     102
2      3  David     101
3      5    Eva     104

In [31]:
department = pd.DataFrame({
    "EmpID": [1,3,4,5],
    "Name": ["Vishnu", "Afsal", "Ram", "Max"],
    "DeptID": [105,106,107,108]
})

department

   EmpID    Name  DeptID
0      1  Vishnu     105
1      3   Afsal     106
2      4     Ram     107
3      5     Max     108

In [32]:
pd.merge(employees, department, on="EmpID")

   EmpID Name_x  DeptID_x  Name_y  DeptID_y
0      1  Alice       101  Vishnu       105
1      3  David       101   Afsal       106
2      5    Eva       104     Max       108

In [35]:
pd.merge(employees, department, on="EmpID", suffixes=("-left","_right"))

   EmpID Name-left  DeptID-left Name_right  DeptID_right
0      1     Alice          101     Vishnu           105
1      3     David          101      Afsal           106
2      5       Eva          104        Max           108

Join

In [37]:
df1 = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
}, index=["a", "b", "c"])


df1

   EmpID     Name
a      1    Alice
b      2      Bob
c      3  Charlie

In [39]:
df2 = pd.DataFrame({
    "Salary": [50000, 60000, 55000]
}, index=["a", "b", "d"])

df2

   Salary
a   50000
b   60000
d   55000

In [40]:
df1.join(df2, how='left')

   EmpID     Name   Salary
a      1    Alice  50000.0
b      2      Bob  60000.0
c      3  Charlie      NaN

In [41]:
df1.join(df2, how='right')

   EmpID   Name  Salary
a    1.0  Alice   50000
b    2.0    Bob   60000
d    NaN    NaN   55000

In [42]:
df1.join(df2, how='inner')

   EmpID   Name  Salary
a      1  Alice   50000
b      2    Bob   60000

In [43]:
df1.join(df2, how='outer')

   EmpID     Name   Salary
a    1.0    Alice  50000.0
b    2.0      Bob  60000.0
c    3.0  Charlie      NaN
d    NaN      NaN  55000.0

In [49]:
df1 = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "Dept": ["HR", "IT", "Finance"]
})

df2 = pd.DataFrame({
    "EmpID": [1, 2, 4],
    "Name": ["Alicia", "Bobby", "David"],   # same column name 'Name'
    "Salary": [50000, 60000, 70000]
})
df1

   EmpID     Name     Dept
0      1    Alice       HR
1      2      Bob       IT
2      3  Charlie  Finance

In [50]:
df2

   EmpID    Name  Salary
0      1  Alicia   50000
1      2   Bobby   60000
2      4   David   70000

In [52]:
df1.join(df2.set_index("EmpID"), on="EmpID", lsuffix="_left", rsuffix="_right")

   EmpID Name_left     Dept Name_right   Salary
0      1     Alice       HR     Alicia  50000.0
1      2       Bob       IT      Bobby  60000.0
2      3   Charlie  Finance        NaN      NaN

#### Advanced Filtering

(a) Multiple conditions with & and |

In [60]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "Age": [25, 30, 35, 40, 22, 28],
    "Dept": ["HR", "IT", "Finance", "IT", "HR", "Finance"],
    "Salary": [48000, 60000, 75000, 82000, 50000, 72000]
}

df = pd.DataFrame(data)
df

      Name  Age     Dept  Salary
0    Alice   25       HR   48000
1      Bob   30       IT   60000
2  Charlie   35  Finance   75000
3    David   40       IT   82000
4      Eva   22       HR   50000
5    Frank   28  Finance   72000

In [54]:
df[(df["Age"] > 25) & (df["Dept"] == "IT")]

    Name  Age Dept  Salary
1    Bob   30   IT   60000
3  David   40   IT   82000

In [55]:
df[(df["Dept"] == "HR") | (df["Dept"] == "IT")]

    Name  Age Dept  Salary
0  Alice   25   HR   48000
1    Bob   30   IT   60000
3  David   40   IT   82000
4    Eva   22   HR   50000

(b) isin()

In [57]:
df[df["Dept"].isin(["IT"])]

    Name  Age Dept  Salary
1    Bob   30   IT   60000
3  David   40   IT   82000

(c) between()

In [58]:
df[df["Age"].between(20,30)]

    Name  Age     Dept  Salary
0  Alice   25       HR   48000
1    Bob   30       IT   60000
4    Eva   22       HR   50000
5  Frank   28  Finance   72000

In [62]:
df.query("Age >20 and Dept=='IT'")

    Name  Age Dept  Salary
1    Bob   30   IT   60000
3  David   40   IT   82000

####  group operations

ðŸ”¹ 1. Group by a single column

In [64]:
df.groupby("Dept")["Salary"].mean()

Dept
Finance    73500.0
HR         49000.0
IT         71000.0
Name: Salary, dtype: float64

ðŸ”¹ 2. Group by multiple columns

In [67]:
df.groupby(["Dept","Age"])["Salary"].mean()

Dept     Age
Finance  28     72000.0
         35     75000.0
HR       22     50000.0
         25     48000.0
IT       30     60000.0
         40     82000.0
Name: Salary, dtype: float64

ðŸ”¹ 3. Aggregating multiple functions

In [68]:
df.groupby("Dept")["Salary"].agg(["mean","median"])

            mean   median
Dept
Finance  73500.0  73500.0
HR       49000.0  49000.0
IT       71000.0  71000.0

In [70]:
grouped = df.groupby("Dept")
for dept, group in grouped:
    print(dept)
    print(group)

Finance
      Name  Age     Dept  Salary
2  Charlie   35  Finance   75000
5    Frank   28  Finance   72000
HR
    Name  Age Dept  Salary
0  Alice   25   HR   48000
4    Eva   22   HR   50000
IT
    Name  Age Dept  Salary
1    Bob   30   IT   60000
3  David   40   IT   82000

## Code:

Concatenate two DataFrames.

In [71]:
df1 = pd.DataFrame({"ID":[1,2,3], "Name":["A","B","C"]})
df2 = pd.DataFrame({"ID":[4,5], "Name":["D","E"]})

In [73]:
pd.concat((df1, df2))

   ID Name
0   1    A
1   2    B
2   3    C
0   4    D
1   5    E

Merge two DataFrames on a common column.

In [75]:
df_emp = pd.DataFrame({
    "EmpID": [101, 102, 103, 104],
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Dept": ["HR", "IT", "Finance", "IT"]
})

In [79]:
df_salary = pd.DataFrame({
    "EmpID": [101, 102, 105, 106],
    "Name": ["Alicia", "Bobby", "Eve", "Frank"],  # same column Name to test suffixes
    "Salary": [50000, 60000, 70000, 80000]
})

In [80]:
pd.merge(df_emp,df_salary, on="EmpID")

   EmpID Name_x Dept  Name_y  Salary
0    101  Alice   HR  Alicia   50000
1    102    Bob   IT   Bobby   60000

In [84]:
pd.merge(df_emp,df_salary, on="EmpID", how="outer")

   EmpID   Name_x     Dept  Name_y   Salary
0    101    Alice       HR  Alicia  50000.0
1    102      Bob       IT   Bobby  60000.0
2    103  Charlie  Finance     NaN      NaN
3    104    David       IT     NaN      NaN
4    105      NaN      NaN     Eve  70000.0
5    106      NaN      NaN   Frank  80000.0

In [85]:
pd.merge(df_emp,df_salary, on="EmpID", how="left")

   EmpID   Name_x     Dept  Name_y   Salary
0    101    Alice       HR  Alicia  50000.0
1    102      Bob       IT   Bobby  60000.0
2    103  Charlie  Finance     NaN      NaN
3    104    David       IT     NaN      NaN

In [86]:
pd.merge(df_emp,df_salary, on="EmpID", how="right")

   EmpID Name_x Dept  Name_y  Salary
0    101  Alice   HR  Alicia   50000
1    102    Bob   IT   Bobby   60000
2    105    NaN  NaN     Eve   70000
3    106    NaN  NaN   Frank   80000

Group by Department and calculate average salary.

In [88]:
df.groupby("Dept")["Salary"].mean()

Dept
Finance    73500.0
HR         49000.0
IT         71000.0
Name: Salary, dtype: float64

## Revise

Concatenate two DataFrames row-wise.

In [90]:
pd.concat((df_emp, df_salary))

   EmpID     Name     Dept   Salary
0    101    Alice       HR      NaN
1    102      Bob       IT      NaN
2    103  Charlie  Finance      NaN
3    104    David       IT      NaN
0    101   Alicia      NaN  50000.0
1    102    Bobby      NaN  60000.0
2    105      Eve      NaN  70000.0
3    106    Frank      NaN  80000.0

Merge employee and department DataFrames on Dept_ID.

In [91]:
df_emp = pd.DataFrame({
    "EmpID": [101, 102, 103, 104, 105],
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Dept_ID": [1, 2, 1, 3, 2],
    "Salary": [50000, 60000, 55000, 70000, 65000]
})

df_emp

   EmpID     Name  Dept_ID  Salary
0    101    Alice        1   50000
1    102      Bob        2   60000
2    103  Charlie        1   55000
3    104    David        3   70000
4    105      Eva        2   65000

In [93]:
df_dept = pd.DataFrame({
    "Dept_ID": [1, 2, 3, 4],
    "Dept_Name": ["HR", "IT", "Finance", "Marketing"],
    "Manager": ["John", "Sara", "Mike", "Laura"]
})

df_dept

   Dept_ID  Dept_Name Manager
0        1         HR    John
1        2         IT    Sara
2        3    Finance    Mike
3        4  Marketing   Laura

In [94]:
pd.merge(df_emp,df_dept, on="Dept_ID")

   EmpID     Name  Dept_ID  Salary Dept_Name Manager
0    101    Alice        1   50000        HR    John
1    102      Bob        2   60000        IT    Sara
2    103  Charlie        1   55000        HR    John
3    104    David        3   70000   Finance    Mike
4    105      Eva        2   65000        IT    Sara

Group employees by Department and find count per group.

In [96]:
df_dept.groupby("Dept_Name").count()

           Dept_ID  Manager
Dept_Name
Finance          1        1
HR               1        1
IT               1        1
Marketing        1        1

Find average salary per department using groupby().

In [98]:
merged = pd.merge(df_emp,df_dept, on="Dept_ID", how="outer")
merged

   EmpID     Name  Dept_ID   Salary  Dept_Name Manager
0  101.0    Alice        1  50000.0         HR    John
1  103.0  Charlie        1  55000.0         HR    John
2  102.0      Bob        2  60000.0         IT    Sara
3  105.0      Eva        2  65000.0         IT    Sara
4  104.0    David        3  70000.0    Finance    Mike
5    NaN      NaN        4      NaN  Marketing   Laura

In [99]:
merged.groupby("Dept_Name")["Salary"].mean()

Dept_Name
Finance      70000.0
HR           52500.0
IT           62500.0
Marketing        NaN
Name: Salary, dtype: float64

In [101]:
merged.groupby("Dept_Name")["Salary"].sum()

Dept_Name
Finance       70000.0
HR           105000.0
IT           125000.0
Marketing         0.0
Name: Salary, dtype: float64